{
    "modelTopology": {
        "class_name": "Sequential",
        "config": {
            "name": "sequential_1",
            "layers": [
                {
                    "class_name": "SimpleRNN",
                    "config": {
                        "name": "simple_rnn_SimpleRNN1",
                        "trainable": true,
                        "batch_input_shape": [
                            null,
                            10,
                            2
                        ],
                        "dtype": "float32",
                        "units": 10,
                        "activation": "tanh",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "RandomNormal",
                            "config": {
                                "mean": 0,
                                "stddev": 0.05,
                                "seed": null
                            }
                        },
                        "recurrent_initializer": {
                            "class_name": "RandomNormal",
                            "config": {
                                "mean": 0,
                                "stddev": 0.05,
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "recurrent_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "recurrent_constraint": null,
                        "bias_constraint": null,
                        "dropout": 0,
                        "recurrent_dropout": 0.20000000298023224,
                        "return_sequences": false,
                        "return_state": false,
                        "go_backwards": false,
                        "stateful": false,
                        "unroll": false
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "units": 2,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "RandomNormal",
                            "config": {
                                "mean": 0,
                                "stddev": 0.05,
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "dense_Dense1",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Activation",
                    "config": {
                        "activation": "linear",
                        "name": "activation_Activation1",
                        "trainable": true
                    }
                }
            ]
        },
        "keras_version": "tfjs-layers 2.7.0",
        "backend": "tensor_flow.js"
    },
    "weightsManifest": [
        {
            "paths": [
                "20201202-c1-weights.bin"
            ],
            "weights": [
                {
                    "name": "simple_rnn_SimpleRNN1/kernel",
                    "shape": [
                        2,
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "simple_rnn_SimpleRNN1/recurrent_kernel",
                    "shape": [
                        10,
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "simple_rnn_SimpleRNN1/bias",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense1/kernel",
                    "shape": [
                        10,
                        2
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense1/bias",
                    "shape": [
                        2
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ],
    "format": "layers-model",
    "generatedBy": "TensorFlow.js tfjs-layers v2.7.0",
    "convertedBy": null
}